/*
    Παράδειγμα 8: 
    Ποιά είναι η έξοδος του παρακάτω κώδικα;
*/

#include <stdio.h>
int main(){

int *ptr;
int arr[5] = {20};

for(ptr = arr+1; ptr < arr+5; ptr++)
	*ptr = *(ptr-1) + *(ptr+1) + 1;
return 0;
}

/*
    Απάντηση:
    Με τη δήλωση του πίνακα arr η τιμή του πρώτου στοιχείου του γίνεται 20 και οι τιµές των υπολοίπων 0. 
    Με την εντολή ptr = arr+1; o ptr δείχνει στο δεύτερο στοιχείο του πίνακα και κάθε φορά που αυξάνεται 
    με την εντολή ptr++ δείχνει στο επόμενο στοιχείο του. O for βρόχος τερματίζεται όταν η τιµή του ptr 
    γίνει ίση µε arr+5, δηλαδή όταν δείξει σε διεύθυνση µνήμης µετά το τελευταίο στοιχείο του πίνακα.

    Κάθε φορά που εκτελείται ο for βρόχος η τιμή του τρέχοντος στοιχείου του πίνακα γίνεται ίση µε το 
    άθροισµα των τιµών του προηγούµενου στοιχείου, του επόµενου και της μονάδας. 
    Για παράδειγμα, στην πρώτη εκτέλεση του βρόχου η εντολή:

    *ptr = * (ptr-1) + * (ptr+1) + 1; είναι ισοδύναµη με arr[1] = arr[0] + arr[2] + 1 = 21;

    Άρα, τα στοιχεία του πίνακα arr [0] έως και arr [3] Θα αποκτήσουν τιµες από 20 έως και 23. 
    Ωστόσο, δεν τελειώσαµε. Τι τιμή θα έχει το arr [4]; 
    H τιμή arr [4] θα ειναι ίση με το άθροισµα του arr [3], της µονάδας και της τυχαίας τιµης 
    που βρισκεται στη διεύθυνση μνήμης αµέσως µετά το arr[4].
*/