/*
    Παράδειγμα 10:
    Ποιες είναι οι τιµές των στοιχείων του πίνακα arr αν, στον for βρόχο του προηγουμενου προγράµµατος (ex104),
    αντί για --*ptr; γραφαμε --*ptr++;
*/

#include <stdio.h>
int main(){

int *ptr;
int arr[5] = {11, 21, 31, 41, 51}, sum = 0;

for (ptr = arr; ptr <= arr+4; ptr++){
    --*ptr++; // instead of --*ptr
    sum += *ptr;
}
printf("Sum = %d\n", sum); // sum = 21 + 41 + random value at position arr[5]

// for (int i = 0; i < 5; i++){
//     printf("arr[%d] = %d\n", i, arr[i]);
// }

return 0;
}

/*
    Απάντηση:
    Η εντολή --*ptr++ πρώτα µειώνει κατά ένα το περιεχόµενο της διεύθυνση στην οποία δείχνει ο ptr 
    και µετά αυξάνει την τιµή του.

    lη επανάληψη. Όπως και πριν, η τιμή του arr [0] γίνεται 10. Μετά, η τιµή του ptr αυξάνεται κατά ένα,
    άρα δείχνει στο δεύτερο στοιχείο του πίνακα.

    2η επανάληψη. Με την εντολή ptr++; ο ptr δείχνει στο τρίτο στοιχείο του πίνακα. Στη συνέχεια, η τιµή 
    του arr[2] γίνεται 30 και ο δείκτης ptr µε την αύξηση κατά ένα δείχνει στο τέταρτο στοιχείο του πίνακα.

    3η επανάληψη. Με την εντολή ptr++; o ptr δείχνει στο πέµπτο στοιχείο του πίνακα. Η τιµή του arr[4] γίνεται 50 
    και o ptr αυξάνεται. Η επόµενη αύξηση του ptr τερµατίζει τον for βρόχο, αφού η τιµή του ξεπερνάει τα όρια του πίνακα.

    Εποµένως, οι τιμές του πίνακα arr γίνονται: 10, 21, 30, 41, 50.
*/