/*
    Παράδειγμα 7:
    Ποια είναι η έξοδος του παρακάτω προγράμματος;
*/


#include <stdio.h>
int main()
{
	int *ptr1, *ptr2, *ptr3;
	int i=10, j=20, k=30;

	ptr1 = &i;
	ptr2 = &j;
	ptr3 = &k;
	
	*ptr1 = *ptr2 = *ptr3;
	k = i+j;
	
	printf("%d\n", *ptr3);
	return 0;
}

/*
    Απάντηση:
    Αφού ο ptr1 δείχνει στη διεύθυνση του i, το *ptr1 θα είναι ίσο με την τιμή του i.
    Παρομοίως, τα *ptr2 και *ptr3 είναι ίσα με τις τιμές των j και k, αντίστοιχα.

    Άρα, η εντολή *ptr1 = *ptr2 = *ptr3; είναι ισοδύναμη με i = j = k = 30.
    Στη συνέχεια, η τιμή του k γίνεται k= i+j = 30+30 = 60, και το πρόγραμμα εμφανίζει : 60
*/