/*
    Παράδειγμα 9:
    Ποια είναι η έξοδος του παρακάτω προγράμματος;
*/

#include <stdio.h>

int main()
{
	int *ptr;
	int i = 10;
	
	ptr = &i;
	(*ptr)++;
	++*ptr;
	
	printf("Val = %d\n", i);
	return 0;
}

/*
    Απάντηση:
    Αφού ο ptr δείχνει στη διεύθυνση της μεταβλητής i, το *ptr θα είναι ίσο με την τιμή του i.
    Άρα, η εντολή (*ptr)++; είναι ισοδύναμη με i++; και η τιμή του i γίνεται 11.

    Οι παρενθέσεις στην έκφραση (*ptr)++; είναι απαραίτητες, γιατί ο τελεστής ++ έχει μεγαλύτερη προτεραιότητα από την *. 
    Δηλαδή, οι εκφράσεις (*ptr)++; και *ptr++; παράγουν διαφορετικό αποτέλεσμα. 
    Όταν θα μιλήσουμε για αριθμητική δεικτών, θα δείτε ότι η έκφραση *ptr++; αυξάνει την τιμή του ptr σύμφωνα με τον τύπο 
    της μεταβλητής στην οποία δείχνει.

    Η έκφραση ++*ptr; είναι ισοδύναμη με ++i, άρα το πρόγραμμα εμφανίζει: Val = 12
*/