/*
    Παράδειγμα 8: Να γραφεί ένα πρόγραμμα το οποίο να διαβάζει τρεις 
    πραγματικούς χωρισμένους με κενό, να τους αποθηκεύει σε τρεις μεταβλητές 
    και να «περιστρέφει» τις τιμές τους μία θέση δεξιά. Για παράδειγμα, έστω 
    ότι ο χρήστης εισάγει τους αριθμούς 1.2, 3.4 και 5.6 και αυτοί αποθηκεύονται
    στις μεταβλητές d1, d2 και d3, αντίστοιχα. Το πρόγραμμα πρέπει να 
    «περιστρέψει» τις τιμές τους μία θέση δεξιά και το d1 να γίνει 5.6, το d2 
    γίνει 1.2 και το d3 να γίνει 3.4.

    d1 -> d3, d2 -> d1, d3 -> d2
*/

#include <stdio.h>


int main(void){
    float a, b, c, tmp;
    printf("Enter three real numbers separated by space: ");
    scanf("%f %f %f", &a, &b, &c);
    printf("Before: (a,b,c) = (%.1f, %.1f, %.1f)\n", a, b, c);

    tmp = c;
    c = b;
    b = tmp;

    tmp = b;
    b = a;
    a = tmp;

    printf("After: (a,b,c) = (%.1f, %.1f, %.1f)\n", a, b, c);

    return 0;
}