/*
    Παράδειγμα 2:
    Πόσες φορές εκτελείται ο while βρόχος στο παρακάτω πρόγραμμα; 
*/

#include <stdio.h>
int main(void)
{
	int a = 256, b = 4;
	while ( a != b ){
		b = b * b;
    }
	return 0;
}

/*
    Απάντηση: Ας αναλύσουμε τις επαναλήψεις:

    1η επανάληψη. Αφού a = 256  και b = 4, η συνθήκη (a != b) είναι αληθής, 
    άρα εκτελείται η εντολή b = b * b = 4 * 4 = 16.

    2η επανάληψη. Αφού a = 256  και b = 16, η συνθήκη (a ! = b) εξακολουθεί να είναι αληθής, 
    άρα εκτελείται η εντολή b = b * b = 16 * 16 = 256.

    3η επανάληψη. Αφού a = 256  και b = 256,  η συνθήκη (a ! = b) ειναι ψευδής, 
    άρα τερματίζεται η εκτέλεση τον βρόχου.

    Επομένως, ο while βρόχος εκτελέστηκε 2 φορές.
*/