/*
    Παράδειγμα 3:
    Ποια θα είναι η έξοδος του παρακάτω προγράμματος;
*/

#include <stdio.h>
int main(void)
{
	int i = -2;
	
	while (i-6)
	{
		printf ("One\n") ; 
		i++;
		while (!(i+1))
		{
			printf ("Two\n"); 
			i--;
		}
		i = i+2;
	}
	return 0;
}

/*
    Απάντηση: 
    Οπως και στην περίπτωση των ένθετων for βρόχων, κάθε επανάληψη ενός εξωτερικού while βρόχου 
    προκαλεί την ολοκληρωμένη εκτέλεση του ένθετου βρόχου. Ας αναλύσουμε την πρώτη επανάληψη του εξωτερικού βρόχου:

    Η εντολή while(i-6) είναι ισοδύναμη με while (i-6 ! = 0) , ενώ η εντολή while (!(i+1)) είναι ισοδύναμη με 
    while (i+1 == 0).

    1η επανάληψη εξωτερικού βρόχου: Αφού η τιμή του i είναι -2, η συνθήκη (i - 6 != 0) είναι αληθής, 
    άρα το πρόγραμμα εμφανίζει One και η τιμή του i γίνεται -1.

    1η επανάληψη εσωτερικού βρόχου: Αφού η τιμή του i είναι -1, η συνθήκη (i+1 == 0) είναι αληθής, 
    άρα το πρόγραμμα εμφανίζει Two και η τιμή του i γίνεται -2.

    2η επανάληψη εσωτερικού βρόχου: Αφού η τιμή του i είναι -2, η συνθήκη (i+1 == 0) δεν είναι αληθής,
     άρα τερματίζεται η εκτέλεση του εσωτερικού βρόχου.

    Στη συνέχεια, εκτελείται η τελευταία εντολή του εξωτερικού βρόχου i = i+ 2 και η τιμή του i γίνεται 0.

    Τελικά, η έξοδος τον προγράμματος είναι: One Two One One
*/