/*
    Παράδειγμα 11:
    Ποια είναι η έξοδος του παρακάτω προγράμματος;
*/

#include <stdio.h>

int main()
{
	int *ptr1, i = 10;
	double *ptr2, j = 1.234;
	
	ptr1 = &i;
	ptr2 = &j;
	
	*ptr1 = *ptr2;
	printf("%d %lu %lu\n", i, sizeof(ptr1), sizeof(ptr2));
	return 0;
}

/*
    Απάντηση:
    Αφού ο ptr1 δείχνει στη διεύθυνση της μεταβλητής i και ο ptr2 στη διεύθυνση της μεταβλητής j
    η εντολή *ptr1 = *ptr2 είναι ισοδύναμη με i = j. Το i εχει δηλωθεί σαν ακέραια μεταβλητή, 
    άρα η τιμή του θα γίνει 1.

    Αφού οι οκτάδες που δεσμεύονται για έναν δείκτη είναι πάντα ίδιες, ανεξάρτητα από τον τύπο των 
    δεδομένων στον οποίο δείχνει ο δείκτης, το πρόγραμμα εμφανίζει: 1 8 8

*/