/*
    Παράδειγμα 12:
    Ποια είναι η έξοδος του παρακάτω προγράμματος;
*/

#include <stdio.h>

int main()
{
	int *ptr1, *ptr2, *ptr3;
	int i = 10, j = 20, k = 30;
	
	ptr1 = &i;
	i = 100;
	
	ptr2 = &j;
	j = *ptr2 + *ptr1;
	
	ptr3 = &k;
	k = *ptr3 + *ptr2;
	
	printf("%d %d %d\n", *ptr1, *ptr2, *ptr3);
	return 0;
}

/*
    Απάντηση:
    Αφού ο ptr1 δείχνει στη διεύθυνση του i, το *ptr1 θα είναι ίσο με την τιμή του i. 
    Η τιμή του i είναι 100, άρα *ptr1=100.

    Αφού ο ptr2 δείχνει στη διεύθυνση του j, το *ptr2 θα είναι ίσο με την τιμή του j, δηλαδή 20.
    Επομένως, με την εντολή j= *ptr2 + *ptr1; η τιμή του j γίνεται j = 20+100 =120.

    Παρόμοια, αφού ο ptr3 δείχνει στη διεύθυνση του k, το *ptr2 θα είναι ίσο με την τιμή του k, δηλαδή 30. 
    Επομένως, με την εντολή k= *ptr3 + *ptr2; η τιμή του k γίνεται j = 30+120 =150.

    Αφού οι τιμές των *ptr1,*ptr2,*ptr3 είναι ίσες με τις τιμές των i,j και k, αντίστοιχα, το πρόγραμμα 
    θα εμφανίσει: 100 120 150
*/