/*
    Παράδειγμα 6: Ποια είναι η έξοδος του παρακάτω προγράμματος;
*/

#include <stdio.h> 
int main(void)
{
	int a = 4, b = 5, c = 6;
	printf("%d\n", (a - 4) || (b++ == c));
	return 0;
}

/*
    Απάντηση: 
    Αφού το a είναι 4, η τιμή της εκφρασης (a- 4) είναι 0. 
    Η τιμή της έκφρασης (b++ == c) είναι 0, γιατί η τιμή του b, που είναι 5 πρώτα συγκρίνεται με την τιμή του c,
    που είναι 6, και μετά αυξάνεται. Άρα αφού και οι δύο όροι έχουν μηδενικές τιμές, το πρόγραμμα εμφανιζει 0. 

    Αν αντί για b++ γράφαμε ++b, το πρόγραμμα θα εμφάνιζε 1.
*/