/*
    Παράδειγμα 7: 
    Ποια είναι η έξοδος του παρακάτω προγράμματος;
*/

#include <stdio.h>
int main(void)
{
	int a = 1, b = 3, c = -4;
	printf("%d\n",!(a > b) && (a-1 == b-3) && (c%2 || (a+b+c)));
	return 0;
}

/*
    Απάντηση: Αφού το a είναι 1 και το b είναι 3, η τιμή της έκφρασης (a > b) είναι 0. Άρα, η τιμή της έκφρασης ! (a > b) είναι 1.

    H τιμή της έκφρασης (a-1 == b-3) είναι 1, αφού ισχύει 0 == 0

    Η τιμή της έκφρασης c%2 είναι 0, γιατί το c είναι -4. H τιμή της έκφρασης (a+b+c) είναι 1+3-4 = 0. Αρα, αφού και οι δύο όροι 
    έχουν μηδενικές τιμές, η τιμή της συνολικης έκφρασης με τον τελεστή || είναι 0.
    Επομένως, αφού ένας όρος έχει μηδενική τιμή, το αποτέλεσμα της συνολικής έκφρασης με τους τελεστές && είναι 0 και το πρόγραμμα 
    εμφανίζει 0.
*/