/*
    Παράδειγμα 2: Ποια είναι η έξοδος του παρακάτω προγράμματος:
        - Η τιμή του j είναι 10
        - Η τιμή του j είναι 3
*/

#include <stdio.h>
int main (void)
{
  int i,  j;
  for(i = 0;  j < 10; i++)
    printf ("One\n"); 
  return 0;
}

/*
    - Απάντηση: 
        Αφού η συνθήκη j < 10 (10 < 10) είναι ψευδής, ο for βρόχος δεν εκτελείται και το πρόγραμμα δεν εμφανίζει τίποτα

    - Απάντηση:
        Αφού η συνθήκη j < 10 (3 < 10) είναι πάντα αληθής, ο for βρόχος δεν τερματίζει ποτέ και το πρόγραμμα εμφανίζει 
        συνεχώς One ("κολλάει").
*/