/*
    Παράδειγμα 6: 
    Ποιά είναι η έξοδος του παρακάτω κώδικα;
*/

#include <stdio.h>
int main(void)
{
	char *ptr, arr[4] = {6, 7, 8, 9};
	int i;

	ptr = arr;
	i = *(int*)ptr;
	printf("Val = %d\n", i);
	return 0;
}

/*
    Απάντηση:
    Με την έκφραση (int*) ptr γίνεται προσαρμογή του τύπου του ptr από char* σε int*, 
    ώστε να έχει πρόσβαση σε τέσσερις οκτάδες μνήμης (4 bytes = 4 x 8 bits = 32 bits). 
    Επομένως, η έκφραση i = *(int* )ptr αποθηκεύει στη μεταβλητή i to περιεχόµενο των τεσσάρων στοιχείων του πίνακα, 
    αφού καθένα από αυτά καταλαµβάνει (αναπαραστάται με) µία οκτάδα.
    Τα στοιχεία του πίνακα αναλύονται σε bit ως εξής:

    6 = 00000110
    7 = 00000111
    8 = 00001000
    9 = 00001001

    Εποµένως, ο αριθμός που θα αποθηκευτεί στη µεταβλητή i και θα εµφανιστεί στην οθόνη 
    είναι ο 00001001000010000000011100000110 = 0x09080706 (hex) = 151521030 (δεκαδικός). 

    Σημειωνεται ότι θα μπορούσαµε να μην έχουµε δηλώσει τον δείκτη ptr και να γράψουµε 
    κατευθειαν i = * (int*) arr ή και i = * (int*) &arr [0]
*/