/*
    Παράδειγμα 7: 
    Ποια είναι η έξοδος του παρακάτω προγράμματος;
*/

#include <stdio.h>
int main(void)
{
	int a,b;
	a = b = 9;
	if (++a == b++ ) {
		printf ("One\n");
    }
	else {
		printf ("Two\n");
    }
	printf ("%d %d\n", a, b);
	return 0;
}

/*
    Με την εντολή ++a αυξάνεται κατευθείαν η τιμή της μεταβλητής α και γίνεται ίση με 10.

    Με την εντολή b++ πρώτα συγκρίνεται η τρέχουσα τιμή της μεταβλητής b με την τιμή τον a και μετά αυξάνεται η τιμή της κατά 1.

    Άρα, αφού η τιμή του a είναι 10 και του b είναι 9 το πρόγραμμα θα εμφανίσει Two και, μετά τη σύγκριση, η τιμή τον b θα γίνει 10.

    Επομένως, το πρόγραμμα θα εμφανίσει: 

    Two
    10 10.
*/