/*
    Παράδειγμα 1:
    Να γραφεί ένα πρόγραμμα το οποίο να δημιουργεί έναν μοναδιαίο τετραγωνικό πίνακα 6x6 
    (δηλ. όλα τα στοιχεία τον πίνακα να έχουν την τιμή μηδέν εκτός από τα στοιχεία της 
    κύριας διαγωνίου του που έχουν την τιμή ένα). 
    Το πρόγραμμα να εμφανίζει τα στοιχεία του πίνακα με τη μορφή πίνακα 6x6 της γραμμικής άλγεβρας.
*/

#include <stdio.h>

int main(void){
    int arr[6][6] = {0};

    for (int i = 0; i < 6; i++){
        for (int j = 0; j < 6; j++){
            if (i == j) arr[i][j] = 1;
            printf("%d ", arr[i][j]);
        }
        printf("\n");
    }

    return 0;
}