/*
    Παράδειγμα 2:
    Να γραφεί ένα πρόγραμμα το οποίο να διαβάζει οκτώ ακεραίους, να τους αποθηκεύει 
    σε έναν πίνακα 2 Χ 4 και να εμφανίζει τα στοιχεία τον πίνακα αντίστροφα, δηλαδή 
    ξεκινώντας από το «κάτω-δεξιά» στοιχείο και καταλήγοντας στο «πάνω-αριστερά».
*/

#include <stdio.h>

int main(void){
    int arr[2][4] = {0};

    for (int i = 0; i < 2; i++){
        for (int j = 0; j < 4; j++){
            printf("Enter arr[%d][%d]: ", i, j);
            scanf("%d", &arr[i][j]);
        }
    }

    printf("-------------\n");
    for (int i = 1; i >= 0; i--){
        for (int j = 3; j >= 0; j--){
            printf("arr[%d][%d] = %d\n", i, j, arr[i][j]);
        }
    }

    return 0;
}
