/*
    Παράδειγμα 4: Ποια είναι η έξοδος του παρακάτω προγράμματος;
*/

#include <stdio.h> 
int main(void) 
{
int a = 10, b = -10; 

if(a > 0 && b < -10) 
	printf("One\n");
else
	printf("Two\n");

if(a > 10 || b == -10)
	printf("One\n");
else
	printf("Two\n");
return 0;
}

/*
    Απάντηση: 
    Αφού η τιµή της μεταβλητής b είναι -10, o δεύτερος όρος της έκφρασης είναι ψευδής και η πρώτη printf() 
    θα εμφανίσει Two. Αφού ο δεύτερος όρος της έκφρασης (a > 10 || b == -10) είναι αληθής, η δεύτερη printf() 
    θα εμφανίσει One.
*/