/*
    Τελεστές Ολίσθησης
    Παράδειγμα 8: 
    Ποια είναι η έξοδος του παρακάτω προγράμματος;
*/

#include <stdio.h>
int main(void)
{
	unsigned int i = 10;
	if((i >> 4) != 0)
		printf("One\n");
	else
		printf("Two\n");

	printf("Val = %d\n", i);
	i = 1;
	if((i << 3) == 8)
		printf("One\n");
	else
		printf("Two\n");

	printf("Val = %d\n", i);
	return 0;
}

/*
    Απάντηση: 
    (Οι δείκτες αναφέρονται στο δυαδικό και το δεκαδικό σύστημα). Αφού η τιμή του i (1010 = 000010102) ολισθημένη τέσσερις θέσεις
     δεξιά γίνεται 000000002, η πρώτη if εντολή εμφανίζει Two.
    Σημειώστε ότι η if συνθήκη δεν αλλάζει την τιμή του i σε 0, απλά ελέγχει αν η τιμή του i μετατοπισμένη τέσσερις θέσεις δεξιά 
    είναι 0 ή όχι. Αφού η τιμή του i παραμένει 10, το πρόγραμμα εμφανίζει στη συνέχεια: Val = 1 0.
    H δεύτερη if εντολή ελέγχει αν η τιμή του i ολισθημένη τρεις θέσεις αριστερά είναι ίση με το 8. Αφού η τιμή 110 = 000000012 
    ολισθημένη τρεις θέσεις αριστερά γίνεται 000010002 = 810 το πρόγραμμα εμφανίζει One.
    Η τιμή του i παραμένει αμετάβλητη, άρα το πρόγραμµα εμφανίζει: Val = 1.
*/