/*
    Παράδειγμα 10: 
    Ποια είναι η έξοδος του παρακάτω προγράµµατος;
*/

#include <stdio.h>
int main(void)
{
	char a = 8;
	a <<= 4;
	printf("Val = %d\n", a);
	return 0;
} 

/*
    Απάντηση: 
    Η έκφραση a <<= 4 ολισθαίνει την τιμή της μεταβλητής a τέσσερις θέσεις αριστερά και την κάνει 10000000.
    H µεταβλητή a έχει δηλωθεί σαν char, εποµένως το bit στη θέση 8 δηλώνει το πρόσημο του αριθμού. Αν η τιμή 
    του είναι 1 o αριθμός είναι αρνητικός, αλλιώς είναι θετικός. Εποµένως, το πρόγραμμα θα εμφανίσει: Val = -128.

    Av αντί για char a; δηλώναμε τη μεταβλητή a ως unsigned char, τότε το bit 8 δεν θα δήλωνε το πρόσημο και το 
    πρόγραμμα θα εµφάνιζε: Val = 128.
    
    Nα θυμάστε ότι είναι ασφαλέστερο να χρησιμοποιείτε τους bit τελεστές σε unsigned μεταβλητές.
*/