/*
    Παράδειγμα 3:
    Τι θα γράψει το παρακάτω πρόγραμμα στο αρχείο εξόδου;
*/


#include <stdio.h>
int main()
{
	FILE *fp[2];
	
	if((fp[0] = fp[1] = fopen("test.txt","w")) != NULL)
	{
		fputs("One", fp[0]);
		fclose(fp[0]);
		fputs("Two", fp[1]);
	}
	return 0;
}

/*
    Απάντηση:
    Η μεταβλητή fp είναι ένας πίνακας δύο στοιχείων, όπου το κάθε στοιχείο του είναι δείκτης σε δομή τύπου FILE.
    Αφού οι δείκτες fp[0] και fp[1] γίνονται ίσοι με την τιμή που επιστρέφει η fopen(), συνδέονται με το ίδιο αρχείο.
    Η πρώτη κλήση της fputs() γράφει One στο αρχείο, ενώ η δεύτερη αποτυγχάνει, γιατί το αρχείο έκλεισε με τη πρώτη fclose().
    Πράγματι, αν ελέγχαμε την τιμή επιστροφής της δεύτερης fputs(), θα βλέπαμε ότι είναι EOF.
    Επομένως, στο αρχείο γράφτηκε: One
*/