/*
    Παράδειγμα 2:
    Ποια είναι τα περιεχόμενα του πίνακα a στο παρακάτω πρόγραμμα;
*/

#include <stdio.h>
int main(void)
{
	int i, a[3] = {4,2,0}, b[3] = {2,3,4};
	for(i = 0; i < 3; i++){
		a[b[i]-a[2-i]]++;
    }
	return 0;
}

/*
    Απάντηση:
    Με τη δήλωση του πίνακα a έχουμε a[0] = 4, a[1] = 2 και a[2] = 0. 
    Παρόμοια, με τη δήλωση του πίνακα b έχουμε b[0] = 2, b[1] = 3 και b[2] = 4. Κατά την εκτέλεση του for βρόχου έχουμε: 

    1η επανάληψη (i = 0): a[b[0]-a[2]] = a[2-0] = a[2]++ = 1. 

    2η επανάληψη (i = 1): a[b[1]-a[1]] = a[3-2] = a[1]++ = 3. 

    3η επανάληψη (i = 2): a[b[2]-a[0]] = a[4-4] = a[0]++ = 5. 

    Επομένως, οι τιμές των a[0], a[1] και a[2] έγιναν 5, 3 και 1 αντίστοιχα.
*/