/*
    Παράδειγμα 12:
    Να γραφεί ένα πρόγραμμα το οποίο να διαβάζει 10 ακεραίους και να τους αποθηκεύει 
    σε ένα πίνακα ακεραίων μόνο όταν: 

        α) Ο τρέχων δείκτης θέσης είναι άρτιος,π.χ 0,2,4..., αλλά και ο δοσμένος ακέραιος είναι επίσης άρτιος. 

        β) Ο τρέχων δείκτης θέσης είναι περιττός,π.χ 1,3,5.., αλλά και ο δοσμένος ακέραιος είναι επίσης περιττός. 
    
    Το πρόγραμμα να μην κάνει δεκτή την εισαγωγή των τιμών 0 και -1. 
    Αφού ολοκληρωθεί η εισαγωγή των ακεραίων στον πίνακα, σε όσα στοιχεία δεν έχει αποθηκευτεί κάποια τιμή θα πρέπει 
    να ανατίθεται η τιμή -1. Το πρόγραμμα να εμφανίζει τα στοιχεία του πίνακα πριν τερματίσει.
*/

#include <stdio.h>

#define SIZE 10

int main(void){

    int num, arr[SIZE];

    for (int i = 0; i < SIZE; i++){
        do {
            printf("Enter an integer except 0 and -1: ");
            scanf("%d", &num);
        } while (num == 0 || num == -1);

        if (i % 2 == 0 && num % 2 == 0){
            arr[i] = num;
        }
        else if (i % 2 != 0 && num % 2 != 0) {
            arr[i] = num;
        }
        else {
            arr[i] = -1;
        }
        printf("arr[%d] = %d\n", i, arr[i]);
    }

    return 0;
}