/*
    Παράδειγμα 15:
    Να γραφεί ένα πρόγραμμα το οποίο να διαβάζει έναν ακέραιο και να εμφανίζει πόσες φορές 
    περιέχεται κάθε δεκαδικό ψηφίο [0-9] στον αριθμό. Για παράδειγμα, αν ο χρήστης εισάγει 
    τον αριθμό 123 το πρόγραμμα να εμφανίσει ότι τα ψηφία 1, 2 και 3 εμφανίζονται από μία 
    φορά και τα υπόλοιπα καμία.
*/

#include <stdio.h>

 int main (void){

	int i, dig_times[10]={0}; /* Σε αυτόν τον πίνακα αποθηκεύεται 
	ο αριθμός εμφανίσεων κάθε ψηφίου.Για παράδειγμα, 
	το dig_times[0] δηλώνει πόσες φορές εμφανίζεται το ψηφίο 0.*/

	printf("Enter number : ");
	scanf("%d", &i);

	if (i < 0){ /* Κάνουμε τον αριθμό θετικό.*/
	    i = -i;
    }
	else if (i == 0){ /* Ελέγχουμε αν ο χρήστης εισήγαγε το 0 */ 
		dig_times[0] = 1;
    }

	while (i > 0 ) {
		dig_times[i % 10]++; 
		i /= 10;
	}	

	for (i = 0; i < 10; i++) printf("Digit %d appears %d times\n", i, dig_times[i]);
	return 0;
}