/*
    Παράδειγμα 16:
    Να γραφεί ένα πρόγραμμα το οποίο να διαβάζει έναν θετικό ακεραίο, 
    να τον μετατρέπει στο δυαδικό σύστημα και να τον εμφανίζει.
*/

#include <stdio.h>

 int main (void){
	int i = 0, j, num, bits[32]; /* Σε αυτόν τον πίνακα θα 
	αποθηκευτούν τα bits του αριθμού, δηλαδή 0 ή 1.
	Το μήκος του πίνακα δηλώνεται ίσο με 32, γιατί μία 
	ακέραια μεταβλητή έχει 32 bits. */
	do{
		printf("Enter positive number: ");
		scanf("%d", &num);
	} while(num <= 0);
	
	/* Διαδοχικές διαιρέσεις με το 2 και αποθήκευση του κάθε
	bit	σε αντίστοιχη θέση στον πίνακα */
	while(num > 0){
		bits[0] = num % 2;
		num /= 2; 
		i++;
	}

	printf("Binary form: ");
	/* Εμφάνιση των bits του αριθμού από αριστερά προς τα
	δεξιά. */
	for(j = i-1; j >= 0; j--)
		printf("%d", bits[j]);
    printf("\n");
	return 0;
}
