/*
    Παράδειγμα 17:
    Ποια είναι η έξοδος του παρακάτω προγράμματος;
*/

#include <stdio.h>

int main(void)
{
	int i ,a[] = {10, 20, 30, 40, 50};
	double b[] = {2.2, 1.94, 0.5, -1, -2};
	
	for(i = 0; a[i] = b[i]; i++) printf("%d ",a[i]);
	return 0;
}

/*
    Απάντηση:
    Η συνθήκη ελέχου a[i]=b[i] είναι ισοδυναμη με την έκφραση(a[i]=b[i]!=0). 
    Αυτή η έκφραση σημαίνει ότι οι τιμές των στοιχείων του πίνακα b αντιγράφονται 
    στα αντίστοιχα στοιχεία τον πίνακα a και γίνεται έλεγχος αν η τιμή τον α [i] έγινε 0. 
    Αν γίνει 0, ο βρόγχος τερματίζεται και δεν γίνεται άλλη αντιγραφή

    Όμως, αφού ο τύπος τον πίνακα a είναι int, ενώ ο τύπος τον πίνακα b ειναι double, μόνο 
    το ακέραιο μέρος των στοιχείων του πίνακα b θα εκχωρείται στα αντίστοιχα στοιχεία του πίνακα a.
    Άρα με την αντιγραφή της τιμής 0.5 η τιμή του a[2] θα γίνει 0 και ο βρόχος θα τερματιστεί.

    Επομένως το πρόγραμμα εμφανίζει: 2 1
*/
