/*
    Παράδειγμα 3:
    Ποια είναι τα περιεχόμενα του πίνακα arr στο παρακάτω πρόγραμμα;
*/


#include <stdio.h>
int main(void)
{
	int i, arr[10] = {0};
	for(i = 0; i < 10; i++){
		arr[i++] = 20;
    }
	return 0;
}

/*
    Απάντηση:
    Με τη δήλωση του πίνακα arr οι τιμές των στοιχείων του γίνονται 0.
    Με την εντολή arr[i++] = 20 πρώτα εκχωρείται η τιμή 20 στο στοιχείο arr[i] 
    και μετά αυξάνεται η τιμή του i. Η τιμή αυτή αυξάνεται πάλι κατά ένα στην for εντολή.

    Άρα, τα στοιχεία του πίνακα με άρτιο δείκτη θέσης, δηλαδή τα  arr[0],arr[2],... γίνονται ίσα με 20, 
    ενώ τα στοιχεία με περιττό δείκτη θέσης, δηλαδή τα arr[1],arr[3],... παραμένουν ίσα με 0.
*/