/*
    Παράδειγμα 4:
    Να γραφεί ένα πρόγραμμα το οποίο να δηλώνει ένα πίνακα 5 πραγματικών και με χρήση επαναληπτικού βρόχου 
    να θέτει τις τιμές 1.1,1.2,1.3,1.4 και 1.5 στα στοιχεία του. Στη συνέχεια, να εμφανίζει τα στοιχεία του 
    πίνακα με αντίστροφη σειρά,δηλαδή από το τελευταίο προς το πρώτο.
*/

#include <stdio.h>

int main(void){
    float arr[5];
    float elem = 1.0;
    for (int i = 0; i < 5; i++){
        arr[i] = elem + 0.1;
        elem += 0.1;
    }

    for (int i = 4; i >= 0; i--){
        printf("%.1f\n", arr[i]);
    }
    return 0;
}