/*
    Παράδειγμα 5:
    Ποια είναι η έξοδος του παρακάτω προγράμματος;
*/

#include <stdio.h>
int main(void)
{
	unsigned char arr[5];
	int i;
	for (i = 0; i < 5; i++)
	{
		arr[i] = 256 + i;
		printf("%d ", arr[i]);
	}
	return 0;
}

/*
    Απάντηση:
    Παρατηρείστε ότι ο αριθμός 256 κωδικοποιείται με 9 bits (100000000). 
    Όμως, αφού ο τύπος των στοιχείων του πίνακα είναι unsigned char μόνο τα 8 χαμηλότερα bits του αριθμόυ 256+i 
    θα αποθηκεύονται κάθε φορά.

    Για παράδειγμα, όταν i=1, μόνο τα 8 χαμηλότερα bits του αριθμού 257(100000001) θα αποθηκευτούν στο arr[1]. 
    Άρα, η τιμή του arr[1] θα γίνει ίση με 1.

    Επομένως, το πρόγραμμα εμφανίζει: 0 1 2 3 4 .
*/