/*
    Παράδειγμα 6:
    Να γραφεί ένα πρόγραμμα το οποίο να διαβάζει 10 ακεραίους και να τους αποθηκεύει σε ένα πίνακα.
    Στη συνέχεια, να ελέγχει αν ο πίνακας είναι συμμετρικός. Ως "συμμετρία" του πίνακα, θεωρείστε την 
    ιδιότητα το πρώτο του στοιχείο να είναι ίσο με το τελευταίο, το δεύτερο με το προτελευταίο, κ.ο.κ.
*/

#include <stdio.h>

#define SIZE 10

int main(void){
    int num, arr[SIZE];
    
    // Initialize array
    for (int i = 0; i < SIZE; i++){
        printf("Enter an integer: ");
        scanf("%d", &num);
        arr[i] = num;
    }
    // Need to compare first half of array with the other half
    for (int i = 0; i < SIZE/2; i++){
        if (arr[i] != arr[SIZE - 1 - i]) {
            printf("Array is not symmetric\n");
            return 0;
        }
    }
    printf("Array is symmetric\n");
    return 0;
}

/*
    Σχόλια (και μια ερώτηση): 
    Αν το μέγεθος του πίνακα ήταν περιττός αριθμός, π.χ. αν το SIZE ήταν 11 και όχι 10, θα άλλαζε κάτι στη παραπάνω λύση;

    Όχι, γιατί το αποτέλεσμα της διαίρεσης στη συνθήκη της for εντολής παραμένει το ίδιο, αφού η μεταβλητή i είναι ακέραια.
    Για παράδειγμα, αν το SIZE ήταν 11 έχουμε: i < 11/2, δηλαδή i<5. Επομένως, το στοιχείο a[5] δεν θα ελεγχθεί, όμως το 
    γεγονός αυτό δεν δημιουργεί κάποιο πρόβλημα γιατί είναι το μεσαίο στοιχείο του πίνακα και δεν επηρεάζει τη "συμμετρία" 
    του πίνακα.
*/