/*
    Παράδειγμα 9:
    Ποια είναι τα περιεχόμενα του πίνακα στο παρακάτω πρόγραμμα;
*/

#include <stdio.h>
int main(void)
{
	int i, arr[3] = {0, 1, 2};
	for(i = 1; i < 4; i++) {
		arr[arr[arr[3-i]]]=i-1;
    }
	return 0;
}

/*
    Απάντηση: 
    Με τη δήλωση του πίνακα arr έχουμε arr[0] = 0,arr[1] = 1 και arr[2] = 2. Κατά την εκτέλεση του for βρόχου έχουμε:
    
    1η επανάληψη (i = 1): arr[arr[arr[2]]] = arr[arr[2]] = arr[2] = 1-1 = 0.

    2η επανάληψη (i = 2): arr[arr[arr[1]]] = arr[arr[1]] = arr[1] = 2-1 = 1.

    3η επανάληψη (i = 3): arr[arr[arr[0]]] = arr[arr[0]] = arr[0] = 3-1 = 2.

    Επομένως, οι τιμές των arr[0], arr[1] και arr[2] γίνονται 2,1και 0 αντίστοιχα.
*/