/*
    Παράδειγμα 5:
    Να γραφεί ένα πρόγραμμα το οποίο να διαβάζει δύο αριθμούς που αντιστοιχούν σε μίλια (π.χ. a και b) 
    και έναν τρίτο αριθμό (π.χ. step). Το πρόγραμμα να εμφανίζει σε μία στήλη τα μίλια και σε μία δεύτερη 
    στήλη τα αντίστοιχα χιλιόμετρα ξεκινώντας από τον πρώτο αριθμό (π.χ. a) μέχρι τον δεύτερο αριθμό (π.χ. b) 
    με βήμα τον τρίτο αριθμό (π.χ. step). Η μεταξύ τους σχέση είναι: 1 μίλι = 1.6 χιλιόμετρα.
*/

#include <stdio.h>

int main(void){
    double a, b;
    int step;
    printf("Enter miles and step: ");
    scanf("%lf %lf %d", &a, &b, &step);

    printf("----------------------\n");
    printf("| miles | kilometers |\n");
    printf("----------------------\n"); 
    for (double i = a; i <= b; i+=step){
        printf("| %.2lf | %.2lf |\n", i, i*1.6);
    }
    return 0;
}