/*
    Παράδειγμα 6: 
    Ποια είναι η έξοδος του παρακάτω προγράμματος;
*/

#include <stdio.h>
int main()
{
  int i, j = 5;

  for(i = 0;  i+j == 5; j++)
  {
    printf ("One\n"); 
    i = 4;
    j - i;
  }
  printf("Val1 = %d Val2 = %d\n", i, j); return 0;
}

/*
    Απάντηση: 
    Ας δούμε αναλυτικά τις επαναλήψεις του βρόχου.

    1η επανάληψη. Αφού η τιμή του i γίνεται 0, η συνθήκη i+j == 5 (0+5 = 5== 5) είναι αληθής 
    και επομένως εμφανίζεται το One. Στη συνέχεια, οι τιμές των i και j γίνονται 4 και 1, αντίστοιχα.

    2η επανάληψη. Η τιμή του j γίνεται j++ = j + 1 = 1 + 1 = 2, άρα η συνθήκη i+j == 5 (4+2 = 6 == 5) 
    δεν είναι αληθής, επομένως τερματίζεται η εκτέλεση του βρόχου.

    Το πρόγραμμα πριν τερματίσει εμφανίζει τις τιμές των i και j, οι οποίες είναι 4 και 2, αντίστοιχα.
*/