/*
    Παράδειγμα 10:
    Να γραφεί ένα πρόγραμμα το οποίο να διαβάζει έναν ακέραιο στο [1, 10] και να εμφανίζει 
    την προπαίδεια του αριθμού. Για παράδειγμα, αν ο χρήστης εισάγει τον αριθμό 5, το πρόγραμμα 
    να εμφανίζει: 1*5 = 5, 2*5 = 10, ..., 10*5 = 50. Το πρόγραμμα θα πρέπει να αναγκάζει τον χρήστη 
    να εισάγει αριθμό που να ανήκει στο [1, 10].
*/

#include <stdio.h>

int main(void){

    int num;
    do{
        printf("Enter an integer in [1, 10]: ");
        scanf("%d", &num);
    } while (num < 1 || num > 10);

    for (int i = 1; i <= 10; i++) {
        printf("%d * %d = %d\n", i, num, i * num);
    }
    return 0;
}